; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v4 ?v10)
             (pred_7 ?v2 ?v13)
             (pred_12 ?v4 ?v13)
             (pred_5 ?v7 ?v4 )
	     (pred_1 ?v4)
             (pred_10 ?v6)
             (pred_3 ?v2)
             (pred_2 ?v13)
             (pred_8 ?v4)
             (pred_4 ?v2)
             (pred_9 ?v4)
             (pred_11 ))



(:action op_5
:parameters (?v11 ?v5 ?v1 ?v12)
:precondition (and (pred_10 ?v11) (pred_10 ?v5) (pred_3 ?v1) (pred_2 ?v12)
          (pred_6 ?v11 ?v5) (pred_7 ?v1 ?v12)
                   (pred_12 ?v5 ?v12) (pred_1 ?v11) 
                   (pred_8 ?v5) (pred_4 ?v1))
:effect (and  (pred_9 ?v5) (not (pred_8 ?v5))))


(:action op_4
:parameters (?v11 ?v8)
:precondition (and (pred_10 ?v11) (pred_10 ?v8)
               (pred_1 ?v11) (pred_6 ?v11 ?v8) (pred_9 ?v8))
:effect (and (pred_1 ?v8) (not (pred_1 ?v11))))

(:action op_2
:parameters (?v11 ?v1)
:precondition (and (pred_10 ?v11) (pred_3 ?v1) 
                  (pred_1 ?v11) (pred_5 ?v1 ?v11) (pred_11 ))
:effect (and (pred_4 ?v1)
   (not (pred_5 ?v1 ?v11)) (not (pred_11 ))))


(:action op_1
:parameters (?v11 ?v9 ?v3)
:precondition (and (pred_10 ?v11) (pred_3 ?v9) (pred_3 ?v3)
                  (pred_1 ?v11) (pred_4 ?v3) (pred_5 ?v9 ?v11))
:effect (and (pred_4 ?v9) (pred_5 ?v3 ?v11)
        (not (pred_4 ?v3)) (not (pred_5 ?v9 ?v11))))

(:action op_3
:parameters (?v11 ?v1)
:precondition (and (pred_10 ?v11) (pred_3 ?v1) 
                  (pred_1 ?v11) (pred_4 ?v1))
:effect (and (pred_11 ) (pred_5 ?v1 ?v11) (not (pred_4 ?v1)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_08 obj_12 obj_11 obj_06 obj_03 obj_09 obj_07 obj_01
    obj_04 obj_13
    obj_02 obj_05
    )

    (:init
       (pred_11)

       (pred_10 obj_10)
       (pred_10 obj_08)
       (pred_10 obj_12)
       (pred_10 obj_11)
       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_07)
       (pred_10 obj_01)
       (pred_2 obj_04)
       (pred_2 obj_13)
       (pred_3 obj_02)
       (pred_3 obj_05)

       (pred_6 obj_10 obj_11)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_08 obj_12)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_12 obj_03)
       (pred_6 obj_12 obj_08)
       (pred_6 obj_11 obj_09)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_11 obj_10)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_03 obj_01)
       (pred_6 obj_03 obj_12)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_09 obj_11)
       (pred_6 obj_07 obj_01)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_01 obj_03)
       (pred_6 obj_01 obj_07)
       (pred_8 obj_07)
       (pred_8 obj_03)
       (pred_12  obj_07 obj_04)
       (pred_12  obj_03 obj_13)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_12)
       (pred_9 obj_11)
       (pred_9 obj_06)
       (pred_9 obj_09)
       (pred_9 obj_01)

       (pred_7  obj_02 obj_04)
       (pred_7  obj_05 obj_13)
       (pred_5 obj_02 obj_06)
       (pred_5 obj_05 obj_12)
       (pred_1 obj_06)
    )

    (:goal (and
       (pred_5 obj_05 obj_11)
    ))
(:constraints
  (always (not (pred_1 obj_10)))
)
)

; plan
1. (op_4 obj_06 obj_08)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_08)
   goals met: 0 of 1
2. (op_4 obj_08 obj_12)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_12)
   goals met: 0 of 1
3. (op_2 obj_12 obj_05)
   deleted: (pred_5 obj_05 obj_12) (pred_11)
   added: (pred_4 obj_05)
   goals met: 0 of 1
4. (op_4 obj_12 obj_08)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_08)
   goals met: 0 of 1
5. (op_4 obj_08 obj_06)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_06)
   goals met: 0 of 1
6. (op_4 obj_06 obj_11)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_11)
   goals met: 0 of 1
7. (op_3 obj_11 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_11) (pred_5 obj_05 obj_11)
   goals met: 1 of 1
